xlloss/RA4E2_HDMI_CEC_RX/src/hal_entry.c
/***********************************************************************************************************************
 * File Name    : hal_entry.c
 * Description  : Main application
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2024 Renesas Electronics Corporation. All rights reserved.
 ***********************************************************************************************************************/
#include "hal_data.h"
#include "rtt_common_utils.h"
#include "application_utils.h"
#include "hdmi_cec_utils.h"
#include "hdmi_ddc_utils.h"

///####################### Application Option Setting #######################

#define APP_HDMI_DDC_PHYSICAL_ADDR_GET   (0) // 0: Use fixed value, 1: Get from sink device edid
#define APP_VENDOR_ID_INSTALL            (0) // 0: Use fixed value, 1: Install using SEGGER RTT Viewer

#define DEBUG_CEC_INTERRUPT_EVENT_OUTPUT (0) // 0: Disabled, 1: Enabled

///#################### End of Application Option Setting ###################

///########################### User Device Setting ##########################

/* My physical address. */
/* Specify your physical address. You can guess from the HDMI connector name you connected this device to.  */
/* If APP_HDMI_DDC_PHYSICAL_ADDR_GET is enabled (1), the value will be updated by information of EDID that acquired via HDMI-DDC (I2C). */
uint8_t my_physical_address[4] =                {0x0, 0x0, 0x0, 0x0}; // 0.0.0.0 for tv

/* My OSD name. */
/* The text will be displayed on TV menu. Maximum length is 14 bytes. */
#define MY_OSD_NAME_LENGTH                      (12)
const uint8_t my_osd_name[MY_OSD_NAME_LENGTH] = "RA CEC DEMO";

/* My Vendor ID. */
/* Specify vendor ID of your connected TV. For example, LG TV: {0x00, 0xE0, 0x91}. Toshiba TV: {0x00, 0x00, 0x39} */
/* If APP_VENDOR_ID_INSTALL is enabled (1), the value will be updated by SEGGER RTT Viewer installation. */
uint8_t my_vendor_id[3] =                       {0x00, 0x00, 0x39};

///####################### End of User Device Setting #######################

#if (DEBUG_CEC_INTERRUPT_EVENT_OUTPUT == 1)
#define RTT_DEBUG(fn_, ...)   APP_PRINT((fn_), ##__VA_ARGS__)
#else
#define RTT_DEBUG(...)
#endif

cec_addr_t my_logical_address = CEC_ADDR_UNREGISTERED;

volatile bool system_audio_mode_support_function = false;
volatile bool system_audio_mode_status = false;

/* List of CEC bus device status */
cec_device_status_t cec_bus_device_list[16];

/* User action request, type and target cec device */
volatile bool user_action_detect_flag = false;
uint8_t       user_action_type        = 0x0;
cec_addr_t    user_action_cec_target;

/* CEC action request and type */
volatile bool cec_action_request_detect_flag = false;
uint8_t       cec_action_type                = 0x0;

/* CEC interrupt event notification flags */
volatile bool        cec_rx_complete_flag = false;
volatile bool        cec_tx_complete_flag = false;
volatile bool        cec_err_flag = false;
volatile cec_error_t cec_err_type;

/* for i2c read */
uint32_t             cec_opecode_reg;
uint32_t             cec_opecode_param1_reg;
uint32_t             cec_opecode_param2_reg;
/* RX buffer for CEC reception data */
struct cec_event cec_ev_package[30] = {0};

#define CEC_RX_DATA_BUFF_DATA_NUMBER (16 * 5)
cec_rx_message_buff_t cec_rx_data_buff[CEC_RX_DATA_BUFF_DATA_NUMBER];
volatile uint8_t      cec_rx_data_buff_next_store_point = 0;

fsp_err_t cec_message_send(cec_addr_t destination, uint8_t opcode, uint8_t const * data_buff, uint8_t data_buff_length);

fsp_err_t cec_logical_address_allocate(void);
fsp_err_t cec_logical_address_allocate_attempt(cec_addr_t local_addr);

void cec_system_audio_mode_support_enabling(void);
void cec_system_audio_mode_request(void);

void cec_rx_data_check(void);
void cec_system_auto_response(cec_rx_message_buff_t const * buff);

void cec_bus_scan(void);
void cec_bus_status_buffer_display(void);

void R_BSP_WarmStart(bsp_warm_start_event_t event);

void hal_entry(void)
{
    fsp_err_t fsp_err = FSP_SUCCESS;
    uint8_t cec_data[CEC_DATA_BUFFER_LENGTH];

    /* Print project banner */
    fsp_pack_version_t fsp_version = {RESET_VALUE};
    R_FSP_VersionGet(&fsp_version);
    APP_PRINT(BANNER_INFO, fsp_version.version_id_b.major,
                fsp_version.version_id_b.minor, fsp_version.version_id_b.patch);
    APP_PRINT(APP_DESCRIPTION);
    APP_PRINT(APP_LED_DESCRIPTION);

    /* Make 500 ms delay for HDMI connection. In deal, the MCU should check the hot plug pin of HDMI connector. */
    R_BSP_SoftwareDelay(500, BSP_DELAY_UNITS_MILLISECONDS);

    /* Initialize and enable external irq for user button detect */
    user_button_irq_initialize();

    /* Initialize LEDs. A pin for LED2 now starts PWM output. */
    demo_system_initialize();

    cec_opecode_reg = 0;
    /* Get physical address */
#if (APP_HDMI_DDC_PHYSICAL_ADDR_GET == 0)
    APP_PRINT("Fixed physical address will be used\r\n");
#else
    APP_PRINT("Getting physical address from EDID via HDMI-DDC channel (I2C) ...\r\n");
    fsp_err = physical_address_get(&my_physical_address[0]);
    if(FSP_SUCCESS != fsp_err)
    {
        APP_PRINT("DDC physical address get failed.\r\n");
        ERROR_INDICATE_LED_ON; __BKPT(0);
    }
#endif
    APP_PRINT("My physical address is %x.%x.%x.%x.\r\n\r\n",
                my_physical_address[3],
                my_physical_address[2],
                my_physical_address[1], my_physical_address[0]);

