xlloss/RA4E2_HDMI_CEC_RX/src/hal_entry.c
        if(p_buff->byte_counter >= 3)
        {
           APP_PRINT(", Data: ");
           for(int j=0; j<(p_buff->byte_counter-2); j++)
           {
               APP_PRINT("0x%x,", p_buff->data_buff[j]);
           }
        }

        APP_PRINT("\r\n");

        if(p_buff->source == my_logical_address)
            goto clear_data;

        cec_opecode_reg = p_buff->opcode;

        switch(p_buff->opcode)
        {
            /* Vendor Specific Commands Feature */
            case CEC_OPCODE_VENDOR_COMMAND:
            {
                cec_action_request_detect_flag = false;
                cec_action_type = CEC_ACTION_VENDOR_COMMAND;
                cec_ev_package[EV_VENDOR_COMMAND].ev_id = EV_VENDOR_COMMAND;
                cec_ev_package[EV_VENDOR_COMMAND].laddr = p_buff->source;
                for (i = 0; i < 14; i++)
                    cec_ev_package[EV_SET_MENU_LANGUAGE].param[i] =
                        p_buff->data_buff[i];

                cec_ev_package[EV_SET_MENU_LANGUAGE].param_sz = 14;
                break;
            }
            case CEC_OPCODE_VENDOR_REMOTE_BUTTON_DOWN:
            {
                cec_action_request_detect_flag = false;
                cec_action_type = CEC_ACTION_VENDOR_COMMAND;
                cec_ev_package[EV_REMOTE_BUTTON_DOWN].ev_id = EV_REMOTE_BUTTON_DOWN;
                cec_ev_package[EV_REMOTE_BUTTON_DOWN].laddr = p_buff->source;
                for (i = 0; i < 14; i++)
                    cec_ev_package[EV_SET_MENU_LANGUAGE].param[i] =
                        p_buff->data_buff[i];

                cec_ev_package[EV_SET_MENU_LANGUAGE].param_sz = 14;
                break;
            }
            /* Audio Rate Control Feature */
            case CEC_OPCODE_SET_AUDIO_RATE:
            {
                cec_action_request_detect_flag = false;
                cec_action_type = CEC_ACTION_SET_AUDIO_RATE;
                cec_ev_package[EV_SET_AUDIO_RATE].ev_id = EV_SET_AUDIO_RATE;
                cec_ev_package[EV_SET_AUDIO_RATE].laddr = p_buff->source;
                cec_ev_package[EV_SET_AUDIO_RATE].param[0] = p_buff->data_buff[0];
                cec_ev_package[EV_SET_AUDIO_RATE].param_sz = 1;
                break;
            }
            /* System Audio Control Feature */
            case CEC_OPCODE_SYSTEM_AUDIO_MODE_REQUEST:
            {
                cec_action_request_detect_flag = false;
                cec_action_type = CEC_ACTION_AUDIO_MODE_REQUEST;
                cec_ev_package[EV_AUDIO_MODE_REQUEST].ev_id = EV_AUDIO_MODE_REQUEST;
                cec_ev_package[EV_AUDIO_MODE_REQUEST].laddr = p_buff->source;
                cec_ev_package[EV_AUDIO_MODE_REQUEST].param[0] = p_buff->data_buff[0];
                cec_ev_package[EV_AUDIO_MODE_REQUEST].param_sz = 1;
                break;
            }
            /* Tuner Control Feature   */
            case CEC_OPCODE_TUNER_STEP_DECREMENT:
            case CEC_OPCODE_TUNER_STEP_INCREMENT:
            {
                cec_action_request_detect_flag = false;
                cec_action_type = CEC_ACTION_REQ_TUNER_CTL;
                cec_ev_package[EV_REQ_TUNER_CTL].ev_id = EV_REQ_TUNER_CTL;
                cec_ev_package[EV_REQ_TUNER_CTL].laddr = p_buff->source;
                cec_ev_package[EV_REQ_TUNER_CTL].param_sz = 0;
                break;
            }
            case CEC_OPCODE_SELECT_DIGITAL_SERVICE:
            case CEC_OPCODE_SELECT_ANALOG_SERVICE:
            {
                cec_action_request_detect_flag = false;
                cec_action_type = CEC_ACTION_SET_TUNER_SERVICE;
                cec_ev_package[EV_SET_TUNER_SERVICE].ev_id = EV_SET_TUNER_SERVICE;
                cec_ev_package[EV_SET_TUNER_SERVICE].laddr = p_buff->source;
                memcpy(&cec_ev_package[EV_SET_TUNER_SERVICE].param[0],
                    &p_buff->data_buff[0], 8);

                cec_ev_package[EV_SET_MENU_LANGUAGE].param_sz = 8;

                break;
            }
            /* CEC_OPCODE_DECK_CONTROL */
            case CEC_OPCODE_DECK_CONTROL:
            {
                break;
            }

            /* Timer Programming Feature */
            case CEC_OPCODE_SET_TIMER_PROGRAM_TITLE:
            {
                cec_action_request_detect_flag = false;
                cec_action_type = CEC_ACTION_SET_TIMER_PROG_TITLE;
                cec_ev_package[EV_SET_TIMER_PROG_TITLE].ev_id = EV_SET_TIMER_PROG_TITLE;
                cec_ev_package[EV_SET_TIMER_PROG_TITLE].laddr = p_buff->source;
                cec_ev_package[EV_SET_TIMER_PROG_TITLE].param_sz = 0;
                break;
            }
            /* One Touch Record Feature */
            case CEC_OPCODE_RECORD_OFF:
            {
                cec_action_request_detect_flag = false;
                cec_action_type = CEC_ACTION_RECORD_OFF;
                cec_ev_package[EV_RECORD_OFF].ev_id = EV_RECORD_OFF;
                cec_ev_package[EV_RECORD_OFF].laddr = p_buff->source;
                cec_ev_package[EV_RECORD_OFF].param_sz = 0;
                break;
            }
            case CEC_OPCODE_SET_SYSTEM_AUDIO_MODE:
            {
                cec_action_request_detect_flag = false;
                cec_action_type = CEC_ACTION_SET_AUDIO_MODE;
                cec_ev_package[EV_SET_AUDIO_MODE].ev_id = EV_SET_AUDIO_MODE;
                cec_ev_package[EV_SET_AUDIO_MODE].laddr = p_buff->source;
                cec_ev_package[EV_SET_AUDIO_MODE].param[0] = p_buff->data_buff[0];
                cec_ev_package[EV_SET_AUDIO_MODE].param_sz = 1;
                break;
            }
            case CEC_OPCODE_SET_OSD_STRING:
            {
                cec_action_request_detect_flag = false;
                cec_action_type = CEC_ACTION_VENDOR_COMMAND;
                cec_ev_package[EV_OSD_STRING].ev_id = EV_OSD_STRING;
                cec_ev_package[EV_OSD_STRING].laddr = p_buff->source;
                for (i = 0; i < 14; i++)
                    cec_ev_package[EV_OSD_STRING].param[i] =
                        p_buff->data_buff[i];

                cec_ev_package[EV_OSD_STRING].param_sz = 14;

                break;
            }
            /* One Touch Play Feature */
            case CEC_OPCODE_INACTIVE_SOURCE:
            {
                cec_ev_package[EV_IACT_SRCE].ev_id = EV_IACT_SRCE;
                cec_ev_package[EV_IACT_SRCE].laddr = p_buff->source;
                cec_ev_package[EV_IACT_SRCE].param[0] = p_buff->data_buff[0];
                cec_ev_package[EV_IACT_SRCE].param_sz = 1;
                break;
            }
            case CEC_OPCODE_ACTIVE_SOURCE:
            {
                /*
                 * Action Required:
                 * 1. Switch TV input to the physical (HDMI) port
                 * 2. Update TV Current Source
                 */
                cec_action_request_detect_flag = false;
                cec_action_type = CEC_ACTION_POWER_ON;
                cec_ev_package[EV_ACT_SRCE].ev_id = EV_ACT_SRCE;

