xlloss/RA4E2_HDMI_CEC_RX/src/hal_entry.c
                /* Logical Address of the active device */
                cec_ev_package[EV_ACT_SRCE].laddr = p_buff->destination;

                /* [Physical Address] */
                cec_ev_package[EV_ACT_SRCE].param[0] = p_buff->data_buff[0];
                cec_ev_package[EV_ACT_SRCE].param_sz = 1;
                break;
            }
            case CEC_OPCODE_TEXT_VIEW_ON:
            case CEC_OPCODE_IMAGE_VIEW_ON:
            {
                cec_action_request_detect_flag = false;
                cec_action_type = CEC_ACTION_POWER_ON;
                if (p_buff->opcode == CEC_OPCODE_IMAGE_VIEW_ON) {
                    cec_ev_package[EV_IMG_VIEW_ON].ev_id = EV_IMG_VIEW_ON;
                    cec_ev_package[EV_IMG_VIEW_ON].opencode = p_buff->opcode;
                } else {
                    cec_ev_package[EV_TEX_VIEW_ON].ev_id = EV_TEX_VIEW_ON;
                    cec_ev_package[EV_TEX_VIEW_ON].opencode = p_buff->opcode;
                }
                cec_ev_package[EV_IMG_VIEW_ON].param_sz = 0;
                break;
            }
            /* Standby Feature */
            case CEC_OPCODE_STANDBY:
            {
//                cec_action_request_detect_flag = true;
//                cec_action_type = CEC_ACTION_POWER_OFF;
//                cec_ev_package[EV_STANDBY].ev_id = EV_STANDBY
//                cec_ev_package[EV_STANDBY].laddr = p_buff->source;
//                cec_ev_package[EV_STANDBY].param_sz = 0;
                break;
            }
            case CEC_OPCODE_USER_CONTROL_PRESSED:
            {
                switch(p_buff->data_buff[0])
                {
                    case USER_CONTROL_VOLUME_UP:
                        cec_action_request_detect_flag = true;
                        cec_action_type = CEC_ACTION_VOLUME_UP;
                        break;
                    case USER_CONTROL_VOLUME_DOWN:
                        cec_action_request_detect_flag = true;
                        cec_action_type = CEC_ACTION_VOLUME_DOWN;
                        break;
                    case USER_CONTROL_MUTE:
                        cec_action_request_detect_flag = true;
                        cec_action_type = CEC_ACTION_VOLUME_MUTE;
                        break;
                    default:
                        /* Do nothing */
                        break;
                }
                break;
            }
            /* System Information Feature */
            case CEC_OPCODE_SET_MENU_LANGUAGE:
            {
                cec_action_request_detect_flag = false;
                cec_action_type = CEC_ACTION_SET_MENU_LANGUAGE;
                cec_ev_package[EV_SET_MENU_LANGUAGE].ev_id = EV_SET_MENU_LANGUAGE;
                cec_ev_package[EV_SET_MENU_LANGUAGE].laddr = p_buff->source;
                cec_ev_package[EV_SET_MENU_LANGUAGE].param[0] = p_buff->data_buff[0];
                cec_ev_package[EV_SET_MENU_LANGUAGE].param[1] = p_buff->data_buff[1];
                cec_ev_package[EV_SET_MENU_LANGUAGE].param[2] = p_buff->data_buff[2];
                cec_ev_package[EV_SET_MENU_LANGUAGE].param_sz = 3;
                break;
            }
            default:
            {
                /* Auto response to supporting (sysytem-level) commands */
                cec_system_auto_response(p_buff);
                break;
            }
        }

        /*
        else
        {
            APP_PRINT("Logical address of received message is same as my logical address."
                     "Ignore this message.\r\n");
        }
        */
clear_data:
        /* Clear the data */
        memset(p_buff, 0x0, sizeof(cec_rx_message_buff_t));

        buff_read_point++;
        if(buff_read_point == CEC_RX_DATA_BUFF_DATA_NUMBER)
        {
            buff_read_point = 0;
        }

no_new_data:
        //if(cec_action_request_detect_flag == true)
        //{
        //    break;
        //}
    }
}

void cec_rx_data_process(uint8_t action_type)
{
    bool mute; uint8_t volume;

    cec_action_request_detect_flag = false;

    switch(action_type)
    {
        case CEC_ACTION_POWER_ON:
            demo_system_power_on();
            cec_bus_device_list[my_logical_address].power_status = 0x1;
            APP_PRINT("[System] Power On.\r\n");
            break;
        case CEC_ACTION_POWER_OFF:
            demo_system_power_off();
            cec_bus_device_list[my_logical_address].power_status = 0x0;
            APP_PRINT("[System] Power Off.\r\n");
            break;
        case CEC_ACTION_VOLUME_UP:
            demo_system_volume_change(false, true);
            demo_system_volume_status_get(&mute, &volume);
            APP_PRINT("[System] Sound volume up. Volume: %d%%.\r\n", volume);
            break;
        case CEC_ACTION_VOLUME_DOWN:
            demo_system_volume_change(false, false);
            demo_system_volume_status_get(&mute, &volume);
            APP_PRINT("[System] Sound volume down. Volume: %d%%.\r\n", volume);
            break;
        case CEC_ACTION_VOLUME_MUTE:
            demo_system_volume_change(true, false);
            demo_system_volume_status_get(&mute, &volume);
            if(mute)
            {
                APP_PRINT("[System] Sound volume mute.\r\n");
            }
            else
            {
                APP_PRINT("[System] Sound volume unmute. Volume: %d%%.\r\n", volume);
            }
            break;
//        case <type defined> ToDo
//        {
//            /* Add your additional operation */
//            break;
//        }
        default:
            /* Do nothing */
            break;
    }
}

void cec_system_auto_response(cec_rx_message_buff_t const * p_rx_data)
{
    fsp_err_t fsp_err = FSP_SUCCESS;
    uint8_t cec_data[CEC_DATA_BUFFER_LENGTH] = {0x0};

    switch(p_rx_data->opcode)
    {
        /* CEC_OPCODE_DECK_CONTROL */
        case CEC_OPCODE_DECK_CONTROL:
        {
//            cec_ev_package[EV_DECK_CONTROL].ev_id = EV_DECK_CONTROL;
//            cec_ev_package[EV_DECK_CONTROL].laddr = p_buff->source;
//            cec_ev_package[EV_DECK_CONTROL].param[0] = p_buff->data_buff[0]);
//            cec_ev_package[EV_DECK_CONTROL].param_sz = 1;

